INSERT INTO 会員.会員(会員番号, 氏名, 会員種別)
VALUES
(1, '山田 太郎', '大人'),
(2, '佐藤 愛子', '子供'),
(3, '三宅 祐一', '大人');

INSERT INTO 書籍.書籍(本番号, タイトル, 著者)
VALUES
(1, '現場で役立つシステム設計の原則', '増田亨'),
(2, 'ドメイン駆動設計', 'エリック・エヴァンス'),
(3, 'オブジェクト指向入門 第2版 原則・コンセプト', 'バートランド・メイヤー'),
(4, 'オブジェクト指向入門 第2版 方法論', 'バートランド・メイヤー'),
(5, '理論から学ぶデータベース実践入門', '奥野幹也'),
(6, 'RDRA2.0 ハンドブック: 軽く柔軟で精度の高い要件定義のモデリング手法', '神崎善司'),
(7, 'ソフトウェアシステムアーキテクチャ構築の原理 第2版', 'ニック・ロザンスキ');

-- イベント履歴テーブルと状態テーブル

-- 蔵書の登録イベント
INSERT INTO 蔵書.蔵書(蔵書番号, 本番号)
VALUES
('1-A', 1),
('1-B', 1),
('1-C', 1),
('2-A', 2),
('2-B', 2),
('2-C', 2),
('2-D', 2),
('2-E', 2),
('2-F', 2),
('2-G', 2),
('2-H', 2),
('3-A', 3),
('4-A', 4),
('5-A', 5),
('6-A', 6),
('7-A', 7);

-- いったん、すべての蔵書を貸出可能に追加（初期状態）
INSERT INTO 蔵書.貸出可能(蔵書番号)
VALUES
('1-A'),
('1-B'),
('1-C'),
('2-A'),
('2-B'),
('2-C'),
('2-D'),
('2-E'),
('2-F'),
('2-G'),
('2-H'),
('3-A'),
('4-A'),
('5-A'),
('6-A'),
('7-A')
;

-- 貸出した
INSERT INTO 貸出.貸出履歴(貸出番号, 蔵書番号, 貸出日)
VALUES
((SELECT NEXTVAL('貸出.貸出番号')), '1-A', CURRENT_DATE);

INSERT INTO 会員.貸出履歴会員関連(会員番号, 貸出番号)
VALUES (1, CURRVAL('貸出.貸出番号'));

-- 貸出したので貸出可能から除外
DELETE FROM 蔵書.貸出可能 WHERE 蔵書番号 = '1-A';

-- 貸出したので、貸出中に追加
INSERT INTO 蔵書.貸出中(蔵書番号)
VALUES ('1-A');

-- Webで予約した
INSERT INTO 予約.予約履歴(予約番号, 会員番号, 本番号)
VALUES
((SELECT NEXTVAL('予約.予約番号')),1, 4);

-- 取り置いた
INSERT INTO 取置.取置履歴(予約番号, 蔵書番号, 取置日)
VALUES
((SELECT CURRVAL('予約.予約番号')), '4-A', CURRENT_DATE - 8);

INSERT INTO 取置.準備完了(蔵書番号, 予約番号, 取置日)
VALUES
('4-A', (SELECT CURRVAL('予約.予約番号')), CURRENT_DATE - 8);

DELETE FROM 蔵書.貸出可能 WHERE 蔵書番号 = '4-A';
INSERT INTO 蔵書.取置中 (蔵書番号) VALUES ('4-A');